app/controllers/projects_controller.rb

INSERT INTO "projects" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-08-28 22:31:06.217597"], ["description", ""], ["title", "asdasd"], ["updated_at", "2014-08-28 22:31:06.217597"]]
---
  def create
    @project = Project.new(project_params)

    if @project.save

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = 1  [["description", "test"], ["updated_at", "2014-08-29 08:20:01.905204"]]
---
  def update
    @project = Project.find(params[:id])
    if @project.update(project_params)